#Дано трехзначное число. В нем зачеркнули первую справа цифру и приписали ее слева. Вывести
try:
    n = int(input("Введите трехзначное число:"))
    #Проверить трехзначное ли число
    if n < 100 or n > 999:
            raise ValueError("Число должно быть в диапазоне от 100 до 999")
    #найти цифру первую справа и поставить ее на первое место
    result = (n % 10) * 100 + (n // 10)
    print("Полученное число:", result)
    #Проверить целое ли число
except ValueError as e:
    if "invalid literal" in str(e):
        print("Ошибка. Вы ввели не целое число. Попробуйте снова.")
    else:
        print("Ошибка")